Repository: biblibre/omeka-s-module-ImportIt
Catalog: language/*.po
Languages: fr

source: Missing required parameter "job_id"
fr: Paramètre obligatoire manquant "job_id"

source: Failed to open log file "%s"
fr: Impossible d'ouvrir le fichier de journalisation "%s"

source: Job #%d does not exist
fr: La tâche #%d n'existe pas

source: Failed to create directory "%s"
fr: Impossible de créer le répertoire "%s"

source: See job details
fr: Voir les détails de la tâche

source: Logs
fr: Journaux

source: %s (job #%d)
fr: %s (tâche #%d)

source: Show details
fr: Voir les détails

source: Download complete log file:
fr: Télécharger le fichier de journalisation complet:

source: Log level
fr: Niveau de journalisation

source: New source
fr: Nouvelle source

source: Add new source
fr: Ajouter une nouvelle source

source: Latest job
fr: Dernière tâche

source: Start import
fr: Démarrer l'import

source: Omeka could not find any sources.
fr: Omeka n'a trouvé aucune source.

source: Edit source
fr: Modifier la source

source: Save changes
fr: Enregistrer les changements

source: Search by source (Import It)
fr: Recherche par source (Import It)

source: Searches for resources that were imported from any of these sources.
fr: Recherche les ressources ayant été importées depuis l'une de ces sources.

source: Select source…
fr: Sélectionner une source…

source: Path
fr: Chemin

source: Alert
fr: Alerte

source: Critical
fr: Critique

source: Notice
fr: Annonce

source: Timestamp
fr: Horodatage

source: Delete all entities before import
fr: Supprimer toutes les entités avant l'import

source: Delete all entities that were imported from this source before starting the new import.
fr: Supprime toutes les entités ayant été importées depuis cette source avant de démarrer le nouvel import.

source: Source successfully created.
fr: Source créée avec succès.

source: Source successfully updated.
fr: Source modifiée avec succès.

source: Source successfully deleted
fr: Source supprimée avec succès

source: Import started in a background job. %s
fr: L'import a démarré dans une tâche de fond. %s

source: Server-side METS
fr: METS côté serveur
