Repository: biblibre/omeka-s-module-ImportIt
Catalog: documentation/locales/*/LC_MESSAGES/documentation.po
Languages: fr

source: Import It documentation
fr: Documentation Import It

source: `Import It`_ is a module for Omeka S. It allows administrators to import repeatedly from external sources into Omeka S.
fr: `Import It`_ est un module pour Omeka S. Il permet aux administrateurs d'importer de manière répétée dans Omeka S depuis des sources externes.

source: The idea is to define a source once in Omeka S, and then import from this source regularly, which can be manual or automatic (using cronjobs for instance).
fr: L'idée est de définir une source une fois dans Omeka S, puis d'importer depuis cette source régulièrement, ce qui peut être fait manuellement ou automatiquement (en utilisant des tâches planifiées par exemple).

source: This is useful for sources that are updated on a regular basis.
fr: C'est utile pour les sources qui sont mises à jour régulièrement.

source: Requirements
fr: Pré-requis

source: Depending on the sources used, there may be other requirements
fr: Selon les sources utilisées, il peut y avoir d'autres pré-requis

source: Supported sources
fr: Sources supportées

source: Import It currently supports only one source type (more will be added later).
fr: Import It prend en charge pour l'instant un seul type de source (d'autres seront ajoutés plus tard).

source: Other modules can add support for other source types.
fr: D'autres modules peuvent ajouter la prise en charge d'autres types de sources.

source: Logs
fr: Journaux

source: Import It does not use the default log mechanism, because imports often produce a lot of log messages and that can slow imports down. It can also make the ``job`` table grow quickly.
fr: Import It n'utilise pas le mécanisme par défaut de journalisation, car les imports produisent souvent beaucoup de messages et cela peut ralentir les imports. Cela peut aussi faire grossir la table ``job`` rapidement.

source: Instead, each import have its own log file on the server. That way they can be rotated with usual tools (eg. logrotate).
fr: À la place, chaque import a son propre fichier de journalisation. De cette manière, ils peuvent être gérés par les outils habituels de rotation de logs (ex: logrotate).

source: They can still be viewed (or downloaded) from the admin interface (until they are rotated).
fr: Ils peuvent néanmoins être visualisés (ou téléchargés) depuis l'interface d'administration (jusqu'à leur rotation).

source: By default, log files are stored in ``OMEKA_PATH/logs/importit``. It can be changed by adding the following code to ``config/local.config.php``:
fr: Par défaut, les fichiers de journaux sont stockés dans ``OMEKA_PATH/logs/importit``. Cela peut être modifié en ajoutant le code suivant dans ``config/local.config.php``:

source: Start import from the command line
fr: Démarrer l'import depuis la ligne de commande

source: To start an import from the command line (useful to run imports periodically), execute the following command:
fr: Pour démarrer un import depuis la ligne de commande (utile pour lancer des imports périodiquement), exécuter la commande suivante:

source: ``<user-id>`` is the ID of an Omeka S user. The import will be run as this user.
fr: ``<user-id>`` est l'ID de l'utilisateur Omeka S. L'import sera exécuté en tant que cet utilisateur.

source: ``<source-id>`` is the ID of the Import It source.
fr: ``<source-id>`` est l'ID de la source Import It.

source: Table of contents
fr: Table des matières

source: Source types
fr: Types de source

source: Server-side METS
fr: METS côté serveur

source: Sources of this type will scan a directory recursively, searching for METS files.
fr: Les sources de ce type parcourront un répertoire de manière récursive, à la recherche de fichier METS.

source: Each METS file will be imported as an item. If it references other files (with ``fptr``) they will be imported as media.
fr: Chaque fichier METS sera importé comme contenu. S'il référence d'autres fichiers (avec ``fptr``) ils seront importés comme média.

source: Only ``dc`` metadata is currently supported.
fr: Seules les métadonnées ``dc`` sont prises en charge.

source: Imported resources are not re-imported on the next runs. In other words, this source type only creates resources. Resources are never updated.
fr: Les ressources importées ne sont pas ré-importées lors des imports suivants. En d'autres termes, ce type de source fait uniquement de la création de ressource. Les ressources ne sont jamais mises à jour.

source: Additional requirements
fr: Pré-requis supplémentaires

source: `Local Media Ingester <https://omeka.org/s/modules/LocalMediaIngester/>`__ if the referenced files are local (on the Omeka server).
fr: `Local Media Ingester <https://omeka.org/s/modules/LocalMediaIngester/>`__ si les fichiers référencés sont locaux (sur le serveur Omeka).

source: Sources of this type have the following settings:
fr: Les sources de ce type ont les paramètres suivants:

source: Path
fr: Chemin

source: The absolute path of the directory containing METS files
fr: Le chemin absolu du répertoire contenant les fichiers METS

source: Visibility of created resources
fr: Visibilité des ressources créées

source: Whether created resources should be made public or private
fr: Si les ressources créées doivent être faites publiques ou privées

source: Process
fr: Processus

source: The import process starts by finding all METS files. Files are considered METS files if:
fr: Le processus d'import commence par trouver tous les fichiers METS. Les fichiers sont considérés comme des fichiers METS si:

source: their extension is ``.xml``,
fr: leur extension est ``.xml``,

source: they are valid XML, and
fr: ils sont du XML valide, et

source: their root element is ``mets``
fr: leur élément racine est ``mets``

source: Then within each METS file we search for all ``/mets/structMap/div`` elements. For each ``div``:
fr: Puis dans chaque fichier METS on cherche tous les éléments ``/mets/structMap/div``. Pour chaque ``div``:

source: Check if we already imported this item (the identifier used is ``/mets[@OBJID]``). If not:
fr: Vérifie si on a déjà importé ce contenu (l'identifiant utilisé est ``/mets[@OBJID]``). Si non:

source: Find the corresponding ``/mets/dmdSec`` element
fr: Trouve l'élément ``/mets/dmdSec`` correspondant

source: Find a ``dc`` element inside this ``dmdSec`` element.
fr: Trouve un élément ``dc`` à l'intérieur de cet élément ``dmdSec``.

source: Transform ``dc``'s children into Omeka literal values
fr: Transforme les enfants de ``dc`` en valeurs litérales Omeka

source: Set the item visibility depending on settings
fr: Définit la visibilité du contenu selon les paramètres

source: Attach the item to the default sites (sites with "Auto-assign new items" on)
fr: Attache le contenu aux sites par défaut (les sites avec "Rattacher automatiquement les nouveaux contenus" activé)

source: Save the item
fr: Enregistre le contenu

source: Then we search for ``fptr`` elements within the ``div``. For each ``fptr`` found, check if we already imported this media (the identifiers used are ``/mets[@OBJID]`` and ``fptr[@FILEID]``). If not:
fr: Puis on cherche les éléments ``fptr`` à l'intérieur du ``div``. Pour chaque ``fptr`` trouvé, on vérifie si on a déjà importé ce média (les identifiants utilisés sont ``/mets[@OBJID]`` et ``fptr[@FILEID]``). Si non:

source: Find the corresponding ``/mets/fileSec//file`` and its ``FLocat`` element. The ``href`` attribute is read to determine the file location. If it starts with ``http://`` or ``https://`` the file is downloaded first. File paths are interpreted relative to the METS file path.
fr: Trouve le ``/mets/fileSec//file`` correspondant et son élément ``FLocat``. L'attribute ``href`` est lu pour déterminer l'emplacement du fichier. S'il commence par ``http://`` ou ``https://`` le fichier est téléchargé. Les chemins de fichier sont interprétés relativement au chemin du fichier METS.

source: If the module ``Alto`` is enabled and the file is an ALTO file, then the file is attached to the media corresponding to the previous ``fptr`` element.
fr: Si le module ``Alto`` est activé et si le fichier un fichier ALTO, alors ce fichier est attaché au média correspondant au précédent élément ``fptr``.

source: If ``Alto`` is not enabled or the file is not an ALTO file, a media is created. If a corresponding ``dmdSec`` element is found then the corresponding ``dc`` data is imported as literal values.
fr: Si ``Alto`` n'est pas activé ou si le fichier n'est pas un fichier ALTO, un média est créé. Si un élément ``dmdSec`` correspondant existe alors les données du ``dc`` correspondant sont importées comme valeurs litérales.

source: To be able to import resources, you need to declare a source. A source has a name, a type and several settings depending on its type. The source type dictates how resources are retrieved (whether it's from a file, a URL, or something else) and transformed before being imported in Omeka.
fr: Pour pouvoir importer des ressources, vous avez besoin de déclarer une source. Une source a un nom, un type et plusieurs paramètres qui dépendent de son type. Le type de source dicte comment les ressources sont récupérées (si c'est depuis un fichier, une URL, ou autre chose) et transformées avant d'être importées dans Omeka.

source: You can have multiple sources of the same type.
fr: Vous pouvez avoir plusieurs sources du même type.

source: Currently there is only one source type, :doc:`Server-Side METS <source-types/server-side-mets>`, which browses local METS files and creates corresponding items and media.
fr: Actuellement il n'y a qu'un seul type de source, :doc:`METS côté serveur <source-types/server-side-mets>`, qui parcoure les fichiers METS locaux et crée les contenus et médias correspondants.

source: Create a source
fr: Créer une source

source: To create a new source, click on "Import It" in the navigation menu.
fr: Pour créer une nouvelle source, cliquez sur "Import It" dans le menu de navigation.

source: Then click on the "Add new source" button.
fr: Puis cliquez sur le bouton "Ajouter une nouvelle source".

source: Give the source a name and select its type, then click on the "Add" button.
fr: Donnez un nom à la source et sélectionnez son type, puis cliquez sur le bouton "Ajouter".

source: Fill the type-specific settings, then click on the "Save changes" button.
fr: Remplissez les paramètres spécifiques au type, puis cliquez sur le bouton "Enregistrer".

source: For more details on type-specific settings, read the corresponding page in :doc:`source-types`.
fr: Pour plus de détails sur les paramètres spécifiques au type, lisez la page correspondante dans :doc:`source-types`.

source: Start import
fr: Démarrer l'import

source: Click on the import icon to go to the import settings form.
fr: Cliquez sur l'icône d'import pour aller sur le formulaire des paramètres d'import.

source: Once the settings are done, click on the "Start import" button.
fr: Une fois le paramétrage fait, cliquez sur le bouton "Démarrer l'import".
